In [1]:
%load_ext sql
%sql sqlite:///PS1.db

Problem Set 1 [75 points]
=======

### Deliverables:

Submit your queries (and only those) using the `submission_template.txt` file that is posted on the class website. Follow the instructions on the file! Upload the file at Canvas (under PS1).


### Instructions / Notes:

* Run the top cell above to load the database `PS1.db` (make sure the database file, `PS1.db`, is in the same directory as this IPython notebook is running in)
* Some of the problems involve _changing_ this database (e.g. deleting rows)- you can always re-download `PS1.db` or make a copy if you want to start fresh!
* You **may** create new IPython notebook cells to use for e.g. testing, debugging, exploring, etc.- this is encouraged in fact!- **just make sure that your final answer for each question is _in its own cell_ and _clearly indicated_**
* When you see `In [*]:` to the left of the cell you are executing, this means that the code / query is _running_.
    * **If the cell is hanging- i.e. running for too long: To restart the SQL connection, you must restart the entire python kernel**
    * To restart kernel using the menu bar: "Kernel >> Restart >> Clear all outputs & restart"), then re-execute the sql connection cell at top
    * You will also need to restart the connection if you want to load a different version of the database file
* Remember:
    * `%sql [SQL]` is for _single line_ SQL queries
    * `%%sql [SQL]` is for _multi line_ SQL queries
* _Have fun!_

Problem 1: Linear Algebra [25 points]
------------------------

Two random 3x3 ($N=3$) matrices have been provided in tables `A` and `B`, having the following schema:
> * `i INT`:   Row index
> * `j INT`:   Column index
> * `val INT`: Cell value

**Note: all of your answers below _must_ work for any _square_ matrix sizes, i.e. any value of $N$**.

Note how the matrices are represented - why do we choose this format?  Run the following queries to see the matrices in a nice format:

In [2]:
%sql SELECT group_concat(val, " , ") AS "A" FROM A GROUP BY i;

 * sqlite:///PS1.db
Done.

[('7 , 5 , 8',), ('10 , 7 , 7',), ('2 , 0 , 5',)]

In [5]:
%sql SELECT group_concat(val, " , ") AS "B" FROM B GROUP BY i;

 * sqlite:///PS1.db
Done.

[('9 , 6 , 10',), ('7 , 6 , 9',), ('1 , 1 , 7',)]

### Part (a): Matrix addition [5 points]

The sum of a matrix $A$ (having dimensions $n\times m$) and a matrix $B$ (having dimensions $n\times m$) is the matrix $C$ (of dimension $n\times m$) having cell at row $i$ and column $j$ equal to:

$C_{ij} = A_{ij} + B_{ij}$

Write a single SQL query to get the sum of $A$ and $B$ (in the same format as $A$ and $B$):

In [2]:
%sql SELECT A.i, A.j, (A.val + B.val) AS val FROM A, B WHERE A.i = B.i AND A.j = B.j

 * sqlite:///PS1.db
Done.

[(0, 0, 16),
 (0, 1, 11),
 (0, 2, 18),
 (1, 0, 17),
 (1, 1, 13),
 (1, 2, 16),
 (2, 0, 3),
 (2, 1, 1),
 (2, 2, 12)]

In [7]:
"""
Expected output below- don't re-evaluate this cell!

NOTE: A valid answer must work for ALL inputs of the given type,
not just this example.  I.e. do not hardcode around this answer / etc!
"""

 * sqlite:///PS1.db
Done.

[(0, 0, 16),
 (0, 1, 11),
 (0, 2, 18),
 (1, 0, 17),
 (1, 1, 13),
 (1, 2, 16),
 (2, 0, 3),
 (2, 1, 1),
 (2, 2, 12)]

### Part (b): Dot product [5 points]

The _dot product_ of two vectors

$a = \begin{bmatrix}a_1 & a_2 & \dots & a_n\end{bmatrix}$

and

$b = \begin{bmatrix}b_1 & b_2 & \dots & b_n\end{bmatrix}$

is

$a\cdot b = \sum_{i=1}^n a_ib_i = a_1b_1 + a_2b_2 + \dots + a_nb_n$

Write a _single SQL query_ to take the dot product of the **third column of $A$** and the **second column of $B$.**:

In [2]:
%sql SELECT SUM(A.val * B.val) AS DotProduct FROM A, B WHERE A.j = 2 AND B.j = 1 AND A.i = B.i

 * sqlite:///PS1.db
Done.

[(95,)]

In [8]:
"""
Expected output below- don't re-evaluate this cell!

NOTE: A valid answer must work for ALL inputs of the given type,
not just this example.  I.e. do not hardcode around this answer / etc!
"""

 * sqlite:///PS1.db
Done.

[(95,)]

### Part (c): Matrix multiplication [5 points]

The product of a matrix $A$ (having dimensions $n\times m$) and a matrix $B$ (having dimensions $m\times p$) is the matrix $C$ (of dimension $n\times p$) having cell at row $i$ and column $j$ equal to:

$C_{ij} = \sum_{k=1}^m A_{ik}B_{kj}$

In other words, to multiply two matrices, get each cell of the resulting matrix $C$, $C_{ij}$, by taking the _dot product_ of the $i$th row of $A$ and the $j$th column of $B$.

Write a single SQL query to get the matrix product of $A$ and $B$ (in the same format as $A$ and $B$):

In [7]:
%sql SELECT A.i, B.j, SUM(A.val * B.val) AS val FROM A,B WHERE A.j = B.i GROUP BY A.i, B.j;

 * sqlite:///PS1.db
Done.

[(0, 0, 106),
 (0, 1, 80),
 (0, 2, 171),
 (1, 0, 146),
 (1, 1, 109),
 (1, 2, 212),
 (2, 0, 23),
 (2, 1, 17),
 (2, 2, 55)]

In [7]:
"""
Expected output below- don't re-evaluate this cell!

NOTE: A valid answer must work for ALL inputs of the given type,
not just this example.  I.e. do not hardcode around this answer / etc!
"""

Done.

[(0, 0, 106),
 (0, 1, 80),
 (0, 2, 171),
 (1, 0, 146),
 (1, 1, 109),
 (1, 2, 212),
 (2, 0, 23),
 (2, 1, 17),
 (2, 2, 55)]

### Part (d): Matrix power [10 points]

The power $A^n$ of a matrix $A$ is defined as the matrix product of $n$ copies of $A$. 

Write a _single SQL query_ that computes the **fourth power** of matrix $A$, in other words, $A^4 = A \cdot A \cdot A \cdot A$:

In [78]:
%sql SELECT A.i, B.j, SUM(A.val * B.val) AS val FROM (SELECT A.i, B.j, SUM(A.val * B.val) AS val FROM A, A B WHERE A.j = B.i GROUP BY A.i, B.j) AS A, (SELECT A.i, B.j, SUM(A.val * B.val) AS val FROM A, A B WHERE A.j = B.i GROUP BY A.i, B.j) AS B WHERE A.j = B.i GROUP BY A.i, B.j;

 * sqlite:///PS1.db
Done.

[(0, 0, 27149),
 (0, 1, 16290),
 (0, 2, 31916),
 (1, 0, 36892),
 (1, 1, 22221),
 (1, 2, 43134),
 (2, 0, 5284),
 (2, 1, 3080),
 (2, 2, 6465)]

In [10]:
"""
Expected output below- don't re-evaluate this cell!

NOTE: A valid answer must work for ALL inputs of the given type,
not just this example.  I.e. do not hardcode around this answer / etc!
"""

 * sqlite:///PS1.db
Done.

[(0, 0, 27149),
 (0, 1, 16290),
 (0, 2, 31916),
 (1, 0, 36892),
 (1, 1, 22221),
 (1, 2, 43134),
 (2, 0, 5284),
 (2, 1, 3080),
 (2, 2, 6465)]

Problem 2: The Sales Database [25 points]
----------------------------------------------

We've prepared and loaded a dataset related to sales data from a company. The dataset has the following schema:

> `Holidays (WeekDate, IsHoliday)`

> `Stores (Store, Type, Size)`

> `TemporalData(Store, WeekDate, Temperature, FuelPrice, CPI, UnemploymentRate)`

> `Sales (Store, Dept, WeekDate, WeeklySales)`

Before you start writing queries on the database, find the schema and the constraints (keys, foreign keys).

### Part (a): Sales during Holidays [10 points]

Using a _single SQL query_, find the store(s) with the largest overall sales during holiday weeks. Further requirements:
* Use the `WITH` clause before the main body of the query to compute a subquery if necessary.
* Return a relation with schema `(Store, AllSales)`.

Write your query here:

In [134]:
%%sql
WITH HolidaySales(Store, HolidaySales) as
    (SELECT Sales.Store, SUM(Sales.WeeklySales)
    FROM Sales, Holidays
    WHERE Sales.WeekDate = Holidays.WeekDate
    AND Holidays.IsHoliday = 'TRUE'
    GROUP BY Sales.Store),
    
    FindMax(FindMax) as
    (SELECT MAX(HolidaySales.HolidaySales)
    FROM HolidaySales)
    SELECT HolidaySales.Store as Store, HolidaySales.HolidaySales as AllSales
    FROM HolidaySales, FindMax
    WHERE HolidaySales.HolidaySales IN FindMax;

 * sqlite:///PS1.db
Done.

[(20, 22490350.81000001)]

In [42]:
"""
Expected output below- don't re-evaluate this cell!

NOTE: A valid answer must work for ALL inputs of the given type,
not just this example.  I.e. do not hardcode around this answer / etc!
"""

 * sqlite:///PS1.db
Done.

[(20, 22490350.81000001)]

### Part (b): When Holidays do not help Sales [10 points]

Using a _single SQL query_, compute the **number** of non-holiday weeks that had larger sales than the overall average sales during holiday weeks. Further requirements:
* Use the `WITH` clause before the main body of the query to compute a subquery if necessary.
* Return a relation with schema `(NumNonHolidays)`.

Write your query here:

In [135]:
%%sql
WITH HolidayWeeklySales(WeekDate, HolidayWeeklySales) as
    (SELECT Sales.WeekDate, SUM(Sales.WeeklySales)
     FROM Sales, Holidays
     WHERE Sales.WeekDate = Holidays.WeekDate
     AND Holidays.IsHoliday = 'TRUE'
     GROUP BY Sales.WeekDate),
     
    HolidayWeeklyAverage(HolidayWeeklyAverage) as
    (SELECT AVG(HolidayWeeklySales.HolidayWeeklySales)
     FROM HolidayWeeklySales),

    NonHolidaySale(WeekDate, NonHolidaySale) as
    (SELECT Sales.WeekDate, SUM(Sales.WeeklySales)
    FROM Sales, Holidays
    WHERE Sales.WeekDate = Holidays.WeekDate
    AND Holidays.IsHoliday = 'FALSE'
    GROUP BY Sales.WeekDate)
    SELECT COUNT(*) as NumNonHolidays
    FROM NonHolidaySale, HolidayWeeklyAverage
    WHERE NonHolidaySale.NonHolidaySale > HolidayWeeklyAverage.HolidayWeeklyAverage;

 * sqlite:///PS1.db
Done.

[(8,)]

In [19]:
"""
Expected output below- don't re-evaluate this cell!

NOTE: A valid answer must work for ALL inputs of the given type,
not just this example.  I.e. do not hardcode around this answer / etc!
"""

Done.

[(8,)]

### Part (c): Total Summer Sales [5 points]

Using a _single SQL query_, compute the total sales during summer (months 6,7,and 8) for each type of store. Further requirements:
* Return a relation with schema `(type, TotalSales)`.

*Hint:* SQLite3 does not support native operations on the DATE datatype. To create a workaround, you can use the `LIKE` predicate and the string concatenation operator (||). You can also use the substring operator that SQLite3 supports (`substr`).

Write your query here:

In [157]:
%%sql
SELECT Stores.Type as type,  SUM(Sales.WeeklySales) as TotalSales
FROM Stores, Sales
WHERE Sales.Store = Stores.Store AND SUBSTR(Sales.WeekDate,6,2) IN ("06", "07", "08")
GROUP BY type;

 * sqlite:///PS1.db
Done.

[('A', 1211554899.8500097),
 ('B', 561610722.3999932),
 ('C', 112555450.65999933)]

In [47]:
"""
Expected output below- don't re-evaluate this cell!

NOTE: A valid answer must work for ALL inputs of the given type,
not just this example.  I.e. do not hardcode around this answer / etc!
"""

 * sqlite:///PS1.db
Done.

[('A', 1211554899.8500097),
 ('B', 561610722.3999932),
 ('C', 112555450.65999933)]

Problem 3: The Traveling SQL Server Salesman Problem [25 points]
--------------------------------------------------

SQL Server salespeople are lucky as far as traveling salespeople go- they only have to sell one or two big enterprise contracts, at one or two offices in Wisconsin, in order to make their monthly quota!

Answer the following questions using the table of streets connecting company office buildings.

**Note that for convenience all streets are included _twice_, as $A \rightarrow B$ and $B \rightarrow A$.  This should make some parts of the problem easier, but remember to take it into account!**

In [13]:
%sql SELECT * FROM streets LIMIT 4;

 * sqlite:///PS1.db
Done.

[(0, 'F', 'UW-Madison', 'DooHickey Collective', 7),
 (0, 'R', 'DooHickey Collective', 'UW-Madison', 7),
 (1, 'F', 'DooHickey Collective', 'Gizmo Corp', 2),
 (1, 'R', 'Gizmo Corp', 'DooHickey Collective', 2)]

### Part (a): One-hop, two-hop, three-hop... [10 points]

Our salesperson has stopped at UW-Madison, to steal some cool new RDBMS technology from CS564-ers, and now wants to go sell it to a company _within 9 miles of UW-Madison and _passing through no more than 3 distinct streets_.  Write a single query, not using `WITH` (see later on), to find all such companies.

Your query should return the schema `(company, distance)` where distance is cumulative from UW-Madison.

Write your query here:

In [14]:
%%sql
SELECT streets1.B AS company, streets1.d AS distance
FROM streets streets1
WHERE streets1.A = "UW-Madison" AND streets1.d <= 9
    UNION
SELECT streets2.B AS company, streets1.d + streets2.d
FROM streets streets1, streets streets2
WHERE streets1.A = "UW-Madison" AND streets1.d + streets2.d <= 9 
    AND streets1.B = streets2.A AND streets2.B <> streets1.A

 * sqlite:///PS1.db
Done.

[('DooHickey Collective', 7),
 ('DooHickey Corp', 9),
 ('Gadget Collective', 9),
 ('Gadget Corp', 6),
 ('Gizmo Corp', 9)]

In [15]:
"""
Expected output below- don't re-evaluate this cell!

NOTE: A valid answer must work for ALL inputs of the given type,
not just this example.  I.e. do not hardcode around this answer / etc!
"""

 * sqlite:///PS1.db
Done.

[('DooHickey Collective', 7),
 ('DooHickey Corp', 9),
 ('Gadget Collective', 9),
 ('Gadget Corp', 6),
 ('Gizmo Corp', 9)]

### Part (b): A stop at the Farm [10 points]

Now, our salesperson is out in the field, and wants to see all routes- and their distances- which will take him/her from a company $A$ to a company $B$, with the following constraints:
* The route must pass through UW-Madison (in order to pick up new RDBMS tech to sell!)
* $A$ and $B$ must _each individually_ be within 2 hops of UW-Madison
* $A$ and $B$ must be different companies
* _The total distance must be $<= 15$_
* Do not use `WITH`
* If you return a path $A \rightarrow B$, _do not include_ $B \rightarrow A$ in your answer!

In order to make your answer a bit cleaner, you may split into two queries, one of which creates a `VIEW`.  A view is a virtual table based on the output set of a SQL query.  A view can be used just like a normal table- the only difference under the hood is that the DBMS re-evaluates the query used to generate it each time a view is queried by a user (thus the data is always up-to date!)

Here's a simple example of a view:

In [16]:
%%sql 
DROP VIEW IF EXISTS short_streets;
CREATE VIEW short_streets AS 
SELECT A, B, d FROM streets WHERE d < 3;
SELECT * FROM short_streets LIMIT 3;

 * sqlite:///PS1.db
Done.
Done.
Done.

[('DooHickey Collective', 'Gizmo Corp', 2),
 ('Gizmo Corp', 'DooHickey Collective', 2),
 ('Gizmo Corp', 'Widget Industries', 1)]

In [16]:
%sql SELECT * FROM Streets

 * sqlite:///PS1.db
Done.

[(0, 'F', 'UW-Madison', 'DooHickey Collective', 7),
 (0, 'R', 'DooHickey Collective', 'UW-Madison', 7),
 (1, 'F', 'DooHickey Collective', 'Gizmo Corp', 2),
 (1, 'R', 'Gizmo Corp', 'DooHickey Collective', 2),
 (2, 'F', 'UW-Madison', 'Gadget Corp', 6),
 (2, 'R', 'Gadget Corp', 'UW-Madison', 6),
 (3, 'F', 'Gadget Corp', 'DooHickey Corp', 3),
 (3, 'R', 'DooHickey Corp', 'Gadget Corp', 3),
 (4, 'F', 'Gizmo Corp', 'GadgetWorks', 8),
 (4, 'R', 'GadgetWorks', 'Gizmo Corp', 8),
 (5, 'F', 'UW-Madison', 'Gadget Collective', 9),
 (5, 'R', 'Gadget Collective', 'UW-Madison', 9),
 (6, 'F', 'Gizmo Corp', 'Widget Industries', 1),
 (6, 'R', 'Widget Industries', 'Gizmo Corp', 1),
 (7, 'F', 'Gadget Corp', 'Gadget Industries', 9),
 (7, 'R', 'Gadget Industries', 'Gadget Corp', 9),
 (8, 'F', 'DooHickey Corp', 'DooHickeyWorks', 3),
 (8, 'R', 'DooHickeyWorks', 'DooHickey Corp', 3),
 (9, 'F', 'Gadget Industries', 'Widget Corp', 5),
 (9, 'R', 'Widget Corp', 'Gadget Industries', 5),
 (10, 'F', 'DooHickey Corp', 'ThingCo', 6),
 (10, 'R', 'ThingCo', 'DooHickey Corp', 6),
 (11, 'F', 'Gadget Collective', 'GizmoWorks', 3),
 (11, 'R', 'GizmoWorks', 'Gadget Collective', 3),
 (12, 'F', 'Widget Industries', 'Gizmo Industries', 1),
 (12, 'R', 'Gizmo Industries', 'Widget Industries', 1),
 (13, 'F', 'DooHickeyWorks', 'Thing Industries', 1),
 (13, 'R', 'Thing Industries', 'DooHickeyWorks', 1),
 (14, 'F', 'Thing Industries', 'Widget Collective', 2),
 (14, 'R', 'Widget Collective', 'Thing Industries', 2),
 (15, 'F', 'Thing Industries', 'Gizmo Collective', 3),
 (15, 'R', 'Gizmo Collective', 'Thing Industries', 3),
 (16, 'F', 'Widget Collective', 'DooHickeyCo', 2),
 (16, 'R', 'DooHickeyCo', 'Widget Collective', 2),
 (17, 'F', 'DooHickeyCo', 'Thing Collective', 9),
 (17, 'R', 'Thing Collective', 'DooHickeyCo', 9),
 (18, 'F', 'DooHickeyCo', 'Thing Corp', 6),
 (18, 'R', 'Thing Corp', 'DooHickeyCo', 6),
 (19, 'F', 'Widget Collective', 'WidgetWorks', 1),
 (19, 'R', 'WidgetWorks', 'Widget Collective', 1),
 (20, 'F', 'Widget Collective', 'GadgetCo', 7),
 (20, 'R', 'GadgetCo', 'Widget Collective', 7),
 (21, 'F', 'Thing Corp', 'GizmoCo', 4),
 (21, 'R', 'GizmoCo', 'Thing Corp', 4),
 (22, 'F', 'Thing Corp', 'DooHickey Industries', 3),
 (22, 'R', 'DooHickey Industries', 'Thing Corp', 3),
 (23, 'F', 'DooHickey Industries', 'WidgetCo', 1),
 (23, 'R', 'WidgetCo', 'DooHickey Industries', 1),
 (24, 'F', 'GizmoCo', 'ThingWorks', 5),
 (24, 'R', 'ThingWorks', 'GizmoCo', 5),
 (25, 'F', 'GadgetCo', 'Thing Industries', 9),
 (25, 'R', 'Thing Industries', 'GadgetCo', 9)]

In [153]:
%%sql 
DROP VIEW IF EXISTS nocycle;
CREATE VIEW nocycle AS
SELECT streets_1.A, streets_1.B, streets_1.d AS dist
FROM streets streets_1
    UNION
SELECT streets_1.A, streets_2.B, streets_1.d + streets_2.d AS dist
FROM streets streets_1, streets streets_2
WHERE streets_1.B = streets_2.A 
    UNION
SELECT streets_1.A, streets_3.B, streets_1.d + streets_2.d + streets_3.d AS dist
FROM streets streets_1, streets streets_2, streets streets_3
WHERE streets_1.B = streets_2.A AND streets_2.B = streets_3.A AND streets_3.B <> streets_1.A;

SELECT nocycle1.B AS company_1, nocycle2.B AS company_2, MIN(nocycle1.dist + nocycle2.dist) AS distance
FROM nocycle nocycle1, nocycle nocycle2
WHERE nocycle1.B <> nocycle2.B AND nocycle1.A = "UW-Madison" AND nocycle2.A = "UW-Madison" AND company_1 > company_2
GROUP BY nocycle1.B, nocycle2.B
HAVING MIN(nocycle1.dist + nocycle2.dist) <= 15;

 * sqlite:///PS1.db
Done.
Done.
Done.

[('Gadget Corp', 'DooHickey Collective', 13),
 ('Gadget Corp', 'DooHickey Corp', 15),
 ('Gadget Corp', 'Gadget Collective', 15),
 ('Gizmo Corp', 'Gadget Corp', 15)]

Write your query or queries here:

In [33]:

"""
Expected output below- don't re-evaluate this cell!

NOTE: A valid answer must work for ALL inputs of the given type,
not just this example.  I.e. do not hardcode around this answer / etc!
"""

 * sqlite:///PS1.db
Done.
Done.
Done.

[('Gadget Corp', 'DooHickey Collective', 13),
 ('Gadget Corp', 'DooHickey Corp', 15),
 ('Gadget Corp', 'Gadget Collective', 15),
 ('Gizmo Corp', 'Gadget Corp', 15)]

### Part (c): Finding Triangles [5 points]

Finally, our salesperson wants to find a route that goes from company $A$ to company $B$ to company $C$ and then back to company $A$ with the following constraints:
* $A$, $B$, $C$ must be different companies
* Do not use `WITH` 
* Output each such route that you find once (use the id's as a way to break ties)
* Output the distance of the route

Write your query here:

In [ ]:
%%sql

In [39]:
"""
Expected output below- don't re-evaluate this cell!

NOTE: A valid answer must work for ALL inputs of the given type,
not just this example.  I.e. do not hardcode around this answer / etc!
"""

 * sqlite:///PS1.db
Done.

[('Thing Industries', 'Widget Collective', 'GadgetCo', 18)]